service/src/test/resources/com/commercetools/pspadapter/payone/util/dummyLineItemWithDiscount.json

{
  "productId":"11111111-1111-1111-1111-111111111111",
  "name": {
    "de": "Armband blau",
    "en": "Bracelet blue"
  },
  "productType": {
    "typeId": "product-type",
    "version": 39
  },
  "productSlug": {
    "de": "armband-blau-4777300700",
    "en": "bracelet-blue-4777300700"
  },
  "variant": {
    "id": 1,
    "sku": "4777300700",
    "prices": [
      {
        "value": {
          "currencyCode": "EUR",
          "centAmount": 6400
        },
        "country": "DE"
      },
      {
        "value": {
          "currencyCode": "GBP",
          "centAmount": 5900
        },
        "country": "GB"
      }
    ],
    "availability": {
      "isOnStock": true,
      "availableQuantity": 1
    }
  },
  "price": {
    "value": {
      "currencyCode": "GBP",
      "centAmount": 5900
    },
    "country": "GB"
  },
  "quantity": 3,
  "discountedPrice": {
    "value": {
      "currencyCode": "GBP",
      "centAmount": 5233
    },
    "includedDiscounts": [
      {
        "discount": {
          "typeId": "cart-discount"
        },
        "discountedAmount": {
          "currencyCode": "GBP",
          "centAmount": 667
        }
      }
    ]
  },
  "discountedPricePerQuantity": [
    {
      "quantity": 2,
      "discountedPrice": {
        "value": {
          "currencyCode": "GBP",
          "centAmount": 5233
        },
        "includedDiscounts": [
          {
            "discount": {
              "typeId": "cart-discount"
            },
            "discountedAmount": {
              "currencyCode": "GBP",
              "centAmount": 667
            }
          }
        ]
      }
    },
    {
      "quantity": 1,
      "discountedPrice": {
        "value": {
          "currencyCode": "GBP",
          "centAmount": 5234
        },
        "includedDiscounts": [
          {
            "discount": {
              "typeId": "cart-discount"
            },
            "discountedAmount": {
              "currencyCode": "GBP",
              "centAmount": 666
            }
          }
        ]
      }
    }
  ],
  "taxRate": {
    "name": "UK",
    "amount": 0.19,
    "includedInPrice": true,
    "country": "GB",
    "id": "cd1xVf8M",
    "subRates": []
  },
  "state": [
    {
      "quantity": 3,
      "state": {
        "typeId": "state"
      }
    }
  ],
  "priceMode": "Platform",
  "totalPrice": {
    "currencyCode": "GBP",
    "centAmount": 15700
  },
  "taxedPrice": {
    "totalNet": {
      "currencyCode": "GBP",
      "centAmount": 12717
    },
    "totalGross": {
      "currencyCode": "GBP",
      "centAmount": 15700
    }
  }
}